jiehuo/app/controllers/asks_controller.rb

  def new
    @domains = Domain.all
---
SELECT `domains`.* FROM `domains`

  def create
    @ask = Ask.new(params[:ask])
    @ask.body = params[:ask][:body].strip
    @ask.user_id = current_user.id
    @ask.modifier = current_user.id
    @ask.image=params[:ask][:image]

    params[:section_hidden].each_key do |key|
      section = Section.find(key)
      @ask.sections << section
---
SELECT `sections`.* FROM `sections` WHERE `sections`.`section_id` = 8 LIMIT 1
INSERT INTO `asks_sections` (`ask_id`, `section_id`) VALUES (155, 8)
INSERT INTO `asks` (`ask_type`, `body`, `body_item`, `comment`, `created_at`, `image`, `modifier`, `project_id`, `result`, `updated_at`, `user_id`) VALUES ('1', '22222若全集U={x∈R|x2≤4}，则集合A={x∈R||x+1|≤1}的补集∁UA为（　　）', '[split]{|x∈R|0≤x＜2|}[split]{|x∈R|0≤x＜2|}[split]{|x∈R|0≤x＜2|}[split]{|x∈R|0≤x＜2|}[split][split]', '{|x∈R|0≤x＜2|}{|x∈R|0≤x＜2|}{|x∈R|0≤x＜2|}{|x∈R|0≤x＜2|}{|x∈R|0≤x＜2|}', '2012-07-04 12:16:29', NULL, 3, 1, 'A', '2012-07-04 12:16:29', 3)

  def hide_ask
    @ask = Ask.find(params[:id])
    if @ask.user_id == current_user.id || current_user.email=="admin@sina.com"
      @ask.state=0
      if @ask.update_attributes(params[:ask])
          #同时删除收藏列表中的该问题记录
          FavoriteAsk.delete_all(["ask_id=?",@ask.ask_id])
---
SELECT `asks`.* FROM `asks` WHERE `asks`.`ask_id` = 159 LIMIT 1
UPDATE `asks` SET `state` = 0, `updated_at` = '2012-07-12 15:42:07' WHERE `asks`.`ask_id` = 159
DELETE FROM `favorite_asks` WHERE (ask_id=159)

  def get_projects_by_domain
    @project_domain=Project.find_all_by_domain_id(params[:id])
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`domain_id` = 1

  def get_sections_by_project
    @section_project= Section.find_all_by_project_id(params[:id])
---
SELECT `sections`.* FROM `sections` WHERE `sections`.`project_id` = 1