jiehuo/app/controllers/user_sessions_controller.rb

SELECT `schools`.* FROM `schools` WHERE `schools`.`provinceid` = '110000'
SELECT `areas`.* FROM `areas` ORDER BY name
---
  def school_ajax
    provinceid = params[:provinceid]
    @schools = School.find_all_by_provinceid(provinceid).map { |u| [u.name, u.id] };
    @area = Area.all(:order => "name").map { |u| [u.name, u.id] }